software/projects/mirth-deploy/src/test/resources/payloads_consent/RegisterConsentCollectionProtocolNotExist.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:mes="http://caXchange.nci.nih.gov/messaging">
	<soapenv:Header />
	<soapenv:Body>
		<mes:caXchangeRequestMessage>
			<mes:metadata>
				<mes:transactionControl>?</mes:transactionControl>
				<mes:serviceType>iHub</mes:serviceType>
				<!--Optional: -->
				<mes:operationName>Register Consent</mes:operationName>
				<mes:externalIdentifier>32225879</mes:externalIdentifier>
				<!--Optional: -->
				<mes:caXchangeIdentifier />
				<!--Optional: -->
				<mes:credentials>
					<!--You have a CHOICE of the next 3 items at this level -->
					<mes:userName>tolvenuser</mes:userName>
					<mes:groupName>nogrid</mes:groupName>
					<mes:gridIdentifier>nogrid</mes:gridIdentifier>
					<!--Optional: -->
					<mes:password>changeme</mes:password>
					<!--Optional: -->
					<mes:delegatedCredentialReference>nocredentials
					</mes:delegatedCredentialReference>
				</mes:credentials>
			</mes:metadata>
			<mes:request>
				<mes:businessMessagePayload>
					<mes:xmlSchemaDefinition>urn:hl7-org:v3</mes:xmlSchemaDefinition>
					<ClinicalDocument
						xsi:schemaLocation="urn:hl7-org:v3 ../cdaXSD/infrastructure/cda/CDA.xsd"
						xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3">
						<realmCode code="US" />
						<typeId root="2.16.840.1.113883.1.3" extension="POCD_HD000040" />
						<!--US Realm Header, consolidated CDA header template -->
						<templateId root="2.16.840.1.113883.10.20.22.1.1"
							assigningAuthorityName="HL7 CCDA" />
						<id root="1.2.1.173000" extension="echr:patient-1823431:clinicalNote-1833300" />
						<code code="59284-0" codeSystem="2.16.840.1.113883.6.1"
							codeSystemName="LOINC" displayName="Consent Document Patient">
							<originalText>Consent Report</originalText>
						</code>
						<title>Consent report</title>
						<effectiveTime value="20110722085054-0700" />
						<confidentialityCode code="N" />
						<languageCode code="en-US" />
						<recordTarget>
							<patientRole>
								<!--study subject identifier -->
								<id root="1.2.1.173000" extension="echr:patient-18234135"
									assigningAuthorityName="iSpy2 Study" />
								<!--patient MRN -->
								<id root="1.2.1.173000" extension="21318234135"
									assigningAuthorityName="ABC Cancer Institute" />
								<addr nullFlavor="NI" />
								<telecom nullFlavor="NI" />
								<patient>
									<name use="L">
										<given>TestOne</given>
										<given />
										<family>Patient</family>
									</name>
									<!--gender -->
									<administrativeGenderCode code="F"
										codeSystem="2.16.840.1.113883.5.1" displayName="Female" />
									<!--birth date -->
									<birthTime value="19670131" />
									<!--marital status -->
									<maritalStatusCode code="M"
										codeSystem="2.16.840.1.113883.5.2" codeSystemName="HL7 MaritalStatus"
										displayName="Married">
										<originalText>Now married</originalText>
									</maritalStatusCode>
									<!--race -->
									<raceCode code="2106-3" displayName="White"
										codeSystem="2.16.840.1.113883.6.238" codeSystemName="Race &amp; Ethnicity - CDC"></raceCode>
									<!--ethnicity -->
									<ethnicGroupCode code="2186-5" displayName="Not Hispanic or Latino"
										codeSystem="2.16.840.1.113883.6.238" codeSystemName="Race &amp; Ethnicity - CDC" />
								</patient>
							</patientRole>
						</recordTarget>
						<author>
							<time nullFlavor="NI" />
							<assignedAuthor>
								<id root="1.2.1.173000" extension="matthew.salesi@ucsfmedctr.org" />
								<addr nullFlavor="NI" />
								<telecom nullFlavor="NI" />
								<assignedPerson>
									<name nullFlavor="NI" />
								</assignedPerson>
							</assignedAuthor>
						</author>
						<custodian>
							<assignedCustodian>
								<representedCustodianOrganization>
									<id root="2.16.840.1.113883.3.26.1.7" extension="TranscendTolven" />
									<name nullFlavor="NI" />
									<telecom nullFlavor="NI" />
									<addr nullFlavor="NI" />
								</representedCustodianOrganization>
							</assignedCustodian>
						</custodian>
						<component>
							<structuredBody>
								<component>
									<section>
										<!--no existing CDA section template, use CDA R2 section to record 
											Tier 1 and Tier 2 response -->
										<title>Consent</title>
										<!--Study Calendar Event Time Point -->
										<entry typeCode="DRIV">
											<observation classCode="OBS" moodCode="EVN">
												<!--Result observation template -->
												<templateId root="2.16.840.1.113883.10.20.22.4.2"
													assigningAuthorityName="HL7 CCDA" />
												<id root="b470f6a6-455c-4185-b6f6-b2b90e1c8f68" />
												<code nullFlavor="OTH">
													<originalText>Study Calendar Event Time Point</originalText>
												</code>
												<!--The Quanity value goes here, @unit uses UCUM code: 5 days -->
												<value xsi:type="PQ" value="5" unit="d" />
												<entryRelationship typeCode="SUBJ">
													<observation classCode="OBS" moodCode="EVN">
														<!--Result observation template -->
														<templateId root="2.16.840.1.113883.10.20.22.4.2"
															assigningAuthorityName="HL7 CCDA" />
														<id root="80f662f4-29d0-474c-b0e0-7108223835dc" />
														<code code="123038009" codeSystem="2.16.840.1.113883.6.96"
															displayName="specimen" />
														<specimen>
															<specimenRole>
																<!--CDMS Specimen ID, assigned by the TRANSCEND CDMS -->
																<id root="fbfe4b85-2bdc-4305-88be-3e1b763d8caa"
																	extension="135" />
															</specimenRole>
														</specimen>
													</observation>
												</entryRelationship>
											</observation>
										</entry>
										<!--Tier 1 Response -->
										<!--no existing CDA template, use observation to record Tier 1 
											Response -->
										<entry typeCode="DRIV">
											<observation classCode="OBS" moodCode="EVN">
												<!--Result observation template -->
												<templateId root="2.16.840.1.113883.10.20.22.4.2"
													assigningAuthorityName="HL7 CCDA" />
												<code code="309370004" codeSystem="2.16.840.1.113883.6.96"
													displayName="consent status">
													<originalText>Tier 1 consent response</originalText>
												</code>
												<!--Consent Date/Time -->
												<effectiveTime value="20110704" />
												<!--yes -->
												<value xsi:type="CD" code="373066001" displayName="yes"
													codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED-CT" />
											</observation>
										</entry>
										<!--Tier 2 Response -->
										<!--no existing CDA template, use observation to record Tier 2 
											Response -->
										<entry typeCode="DRIV">
											<observation classCode="OBS" moodCode="EVN">
												<!--Result observation template -->
												<templateId root="2.16.840.1.113883.10.20.22.4.2"
													assigningAuthorityName="HL7 CCDA" />
												<code code="309370004" codeSystem="2.16.840.1.113883.6.96"
													displayName="consent status">
													<originalText>Tier 2 consent response</originalText>
												</code>
												<!--Consent Date/Time -->
												<effectiveTime value="20110704" />
												<!--no -->
												<value xsi:type="CD" code="373067005" displayName="no"
													codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED-CT" />
											</observation>
										</entry>
									</section>
								</component>
							</structuredBody>
						</component>
					</ClinicalDocument>
				</mes:businessMessagePayload>
			</mes:request>
		</mes:caXchangeRequestMessage>
	</soapenv:Body>
</soapenv:Envelope>